# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [2]:
# import libraries here
from sklearn import linear_model
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [3]:
# your code here
temp = pd.read_csv("Temp_States.csv")

#### Print `temp`.

In [7]:
# your code here
temp

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [5]:
# your code here
temp.dtypes

City            object
State           object
Temperature    float64
dtype: object

In [ ]:
"""
We have two columns with strings and one column with floats.
"""

#### Select the rows where state is New York.

In [6]:
# your code here
temp[temp["State"]=="New York"]

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [9]:
# your code here
temp[temp["State"]=="New York"]["Temperature"].mean()

10.74074074074074

#### Which states and cities have a temperature above 15 degrees Celsius?

In [10]:
# your code here
temp[temp["Temperature"]>15]

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
5    Treton   New Jersey    22.222222
6    Newark   New Jersey    20.000000

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [12]:
# your code here
temp[temp["Temperature"]>15]["City"].unique()

array(['NYC', 'Hartford', 'Treton', 'Newark'], dtype=object)

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [19]:
# your code here
temp[(temp["Temperature"] > 15) & (temp["Temperature"] < 20)]["City"].unique()

array(['NYC', 'Hartford'], dtype=object)

#### Find the mean and standard deviation of the temperature of each state.

In [24]:
# your code here
temp.groupby(["State"]).agg({"Temperature":"mean"}).reset_index()

         State  Temperature
0  Connecticut    15.833333
1   New Jersey    21.111111
2     New York    10.740741

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [25]:
# your code here
employees = pd.read_csv("Employee.csv")
employees

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

#### Explore the data types of the `employees` dataframe. Comment your results.

In [26]:
# your code here
employees.dtypes

Name          object
Department    object
Education     object
Gender        object
Title         object
Years          int64
Salary         int64
dtype: object

In [ ]:
"""
your comments here
"""

#### What's the average salary in this company?

In [27]:
# your code here
employees["Salary"].mean()

48.888888888888886

#### What's the highest salary?

In [28]:
# your code here
employees["Salary"].max()

70

#### What's the lowest salary?

In [29]:
# your code here
employees["Salary"].min()

30

#### Who are the employees with the lowest salary?

In [33]:
# your code here
employees[employees["Salary"]==employees["Salary"].min()]["Name"]

1    Maria
2    David
Name: Name, dtype: object

#### Find all the information about an employee called David.

In [38]:
# your code here
employees[employees["Name"]=="David"]

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you return only David's salary?

In [39]:
# your code here
employees[employees["Name"]=="David"]["Salary"]

2    30
Name: Salary, dtype: int64

#### Print all the rows where job title is associate.

In [41]:
# your code here
employees[employees["Title"]=="associate"]

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [42]:
# Method 1
# your code here

employees.head(3)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [44]:
# Method 2
# your code here
employees[:3]

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees whose title is associate and whose salary is above 55.

In [49]:
# your code here
employees[(employees["Title"]=="associate") & (employees["Salary"]>55)]

    Name Department Education Gender      Title  Years  Salary
7  Pedro         IT       Phd      M  associate      7      60

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [52]:
# your code here
employees.groupby("Years").agg({"Salary":"mean"})

          Salary
Years
1      35.000000
2      38.333333
3      55.000000
4      35.000000
7      60.000000
8      70.000000

####  What is the average salary per title?

In [53]:
# your code here
employees.groupby("Title").agg({"Salary":"mean"})

              Salary
Title
VP         70.000000
analyst    32.500000
associate  56.666667

####  Find the salary quartiles.

In [55]:
# your code here
q1 = employees["Salary"].quantile(0.25)
q2 = employees["Salary"].quantile(0.50)
q3 = employees["Salary"].quantile(0.75)

print(f"The first quartile is {q1}")
print(f"The second quartile is {q2}")
print(f"The third quartile is {q3}")

The first quartile is 35.0
The second quartile is 55.0
The third quartile is 60.0

#### Is the mean salary different per gender?

In [54]:
# your code here
employees.groupby("Gender").agg({"Salary":"mean"})

        Salary
Gender
F         47.5
M         50.0

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [61]:
employees.groupby("Department").agg({"Years":["min","mean","max"],"Salary":["min","mean","max"]})

           Years               Salary
             min      mean max    min   mean max
Department
HR             2  4.666667   8     30  45.00  70
IT             1  4.500000   8     30  48.75  70
Sales          2  2.500000   3     55  55.00  55

In [62]:
employees.groupby("Department")["Salary","Years"].agg(["mean", "min", "max"])

C:\Users\sfsou\AppData\Local\Temp\ipykernel_22860\1075212503.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  employees.groupby("Department")["Salary","Years"].agg(["mean", "min", "max"])

           Salary             Years
             mean min max      mean min max
Department
HR          45.00  30  70  4.666667   2   8
IT          48.75  30  70  4.500000   1   8
Sales       55.00  55  55  2.500000   2   3

In [56]:
# your code here
employees.describe()

          Years     Salary
count  9.000000   9.000000
mean   4.111111  48.888889
std    2.803767  16.541194
min    1.000000  30.000000
25%    2.000000  35.000000
50%    3.000000  55.000000
75%    7.000000  60.000000
max    8.000000  70.000000

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [70]:
# your code here
employees.groupby("Department").agg({"Salary": lambda x: x.max() - x.min()}).reset_index()

  Department  Salary
0         HR      40
1         IT      40
2      Sales       0

In [69]:
employees.groupby("Department")["Salary"].apply(lambda x: x.max() - x.min()).reset_index()

  Department  Salary
0         HR      40
1         IT      40
2      Sales       0

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [73]:
# your code here
orders = pd.read_csv("Orders.csv")
orders.head()

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [77]:
# your code here
orders.dtypes

Unnamed: 0        int64
InvoiceNo         int64
StockCode        object
year              int64
month             int64
day               int64
hour              int64
Description      object
Quantity          int64
InvoiceDate      object
UnitPrice       float64
CustomerID        int64
Country          object
amount_spent    float64
dtype: object

In [78]:
orders.describe

<bound method NDFrame.describe of         Unnamed: 0  InvoiceNo StockCode  year  month  day  hour  \
0                0     536365    85123A  2010     12    3     8
1                1     536365     71053  2010     12    3     8
2                2     536365    84406B  2010     12    3     8
3                3     536365    84029G  2010     12    3     8
4                4     536365    84029E  2010     12    3     8
...            ...        ...       ...   ...    ...  ...   ...
397919      541904     581587     22613  2011     12    5    12
397920      541905     581587     22899  2011     12    5    12
397921      541906     581587     23254  2011     12    5    12
397922      541907     581587     23255  2011     12    5    12
397923      541908     581587     22138  2011     12    5    12

                                Description  Quantity          InvoiceDate  \
0        white hanging heart t-light holder         6  2010-12-01 08:26:00
1                       white metal lantern         6  2010-12-01 08:26:00
2            cream cupid hearts coat hanger         8  2010-12-01 08:26:00
3       knitted union flag hot water bottle         6  2010-12-01 08:26:00
4            red woolly hottie white heart.         6  2010-12-01 08:26:00
...                                     ...       ...                  ...
397919          pack of 20 spaceboy napkins        12  2011-12-09 12:50:00
397920         children's apron dolly girl          6  2011-12-09 12:50:00
397921        childrens cutlery dolly girl          4  2011-12-09 12:50:00
397922      childrens cutlery circus parade         4  2011-12-09 12:50:00
397923        baking set 9 piece retrospot          3  2011-12-09 12:50:00

        UnitPrice  CustomerID         Country  amount_spent
0            2.55       17850  United Kingdom         15.30
1            3.39       17850  United Kingdom         20.34
2            2.75       17850  United Kingdom         22.00
3            3.39       17850  United Kingdom         20.34
4            3.39       17850  United Kingdom         20.34
...           ...         ...             ...           ...
397919       0.85       12680          France         10.20
397920       2.10       12680          France         12.60
397921       4.15       12680          France         16.60
397922       4.15       12680          France         16.60
397923       4.95       12680          France         14.85

[397924 rows x 14 columns]>

In [ ]:
"""
your comments here
"""

####  What is the average purchase price?

In [79]:
# your code here
orders["UnitPrice"].mean()

3.1161744805540756

#### What are the highest and lowest purchase prices?

In [80]:
# your code here
print(orders["UnitPrice"].max())
print(orders["UnitPrice"].min())

8142.75
0.0

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [81]:
# your code here
orders[orders["Country"]=="Spain"]

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
4250,6421,536944,22383,2010,12,5,12,lunch bag suki design,70,2010-12-03 12:20:00,1.65,12557,Spain,115.50
4251,6422,536944,22384,2010,12,5,12,lunch bag pink polkadot,100,2010-12-03 12:20:00,1.45,12557,Spain,145.00
4252,6423,536944,20727,2010,12,5,12,lunch bag black skull.,60,2010-12-03 12:20:00,1.65,12557,Spain,99.00
4253,6424,536944,20725,2010,12,5,12,lunch bag red retrospot,70,2010-12-03 12:20:00,1.65,12557,Spain,115.50
4254,6425,536944,20728,2010,12,5,12,lunch bag cars blue,100,2010-12-03 12:20:00,1.45,12557,Spain,145.00
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
394733,535271,581193,23291,2011,12,3,17,dolly girl childrens cup,2,2011-12-07 17:05:00,1.25,17097,Spain,2.50
394734,535272,581193,85232D,2011,12,3,17,set/3 decoupage stacking tins,1,2011-12-07 17:05:00,4.95,17097,Spain,4.95
394735,535273,581193,22721,2011,12,3,17,set of 3 cake tins sketchbook,2,2011-12-07 17:05:00,1.95,17097,Spain,3.90
394736,535274,581193,23241,2011,12,3,17,treasure tin gymkhana design,1,2011-12-07 17:05:00,2.08,17097,Spain,2.08
394737,535275,581193,23247,2011,12,3,17,biscuit tin 50's christmas,1,2011-12-07 17:05:00,2.89,17097,Spain,2.89

#### How many customers do we have in Spain?

In [ ]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [ ]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [ ]:
# your code here

#### Select all free orders.

In [ ]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [ ]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [ ]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your code here

#### Select all orders made in the month of August.

In [ ]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [ ]:
# your code here

#### What's the  average amount of money spent by country?

In [ ]:
# your code here

#### What's the most expensive item?

In [ ]:
# your code here

#### What is the average amount spent per year?

In [ ]:
# your code here